tutorials/testPCM/smoothHT/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    hotWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          52;
        startFace       7364;
    }
    coldWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          52;
        startFace       7416;
    }
    insulatedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          144;
        startFace       7468;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          7488;
        startFace       7612;
    }
)

// ************************************************************************* //
